Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor(Autodesk.Revit.DB.Color)
Constructs a color entry with no value assigned.
color:
Color assigned to the entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor(Autodesk.Revit.DB.Color,System.Double)
Constructs a color entry with a specific value assigned.
color:
Color assigned to the entry.
value:
Value assigned to the entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011